#!/bin/bash

set -e

# Set install mode to online since boot.sh is used for curl installations
export OMADORA_ONLINE_INSTALL=true

ansi_art='
▄██████▄    ▄▄▄▄███▄▄▄▄      ▄████████ ████████▄   ▄██████▄     ▄████████    ▄████████
███    ███ ▄██▀▀▀███▀▀▀██▄   ███    ███ ███   ▀███ ███    ███   ███    ███   ███    ███
███    ███ ███   ███   ███   ███    ███ ███    ███ ███    ███   ███    ███   ███    ███
███    ███ ███   ███   ███   ███    ███ ███    ███ ███    ███  ▄███▄▄▄▄██▀   ███    ███
███    ███ ███   ███   ███ ▀███████████ ███    ███ ███    ███ ▀▀███▀▀▀▀▀   ▀███████████
███    ███ ███   ███   ███   ███    ███ ███    ███ ███    ███ ▀███████████   ███    ███
███    ███ ███   ███   ███   ███    ███ ███   ▄███ ███    ███   ███    ███   ███    ███
 ▀██████▀   ▀█   ███   █▀    ███    █▀  ████████▀   ▀██████▀    ███    ███   ███    █▀
                                                                ███    ███'

clear
echo -e "\n$ansi_art\n"

echo "Installing git to clone the Omadora repo..."
sudo dnf install -y git

# Use custom repo if specified, otherwise default
OMADORA_REPO="${OMADORA_REPO:-elpritchos/omadora}"

# Use custom branch if instructed, otherwise default to master
OMADORA_REF="${OMADORA_REF:-master}"

echo -e "\nCloning Omadora from: https://github.com/${OMADORA_REPO}.git"
echo -e "\e[32mUsing ref: $OMADORA_REF\e[0m"
rm -rf ~/.local/share/omadora/
git clone --depth 1 --branch "$OMADORA_REF" "https://github.com/${OMADORA_REPO}.git" ~/.local/share/omadora >/dev/null

echo -e "\nInstallation starting..."
source ~/.local/share/omadora/install.sh
